#+title: Exercise1.2
#+date: <2019-06-01 Sat>
#+author: responsible
** DONE 1.11
   CLOSED: [2019-06-05 Wed 00:20]
#+begin_src scheme :exports both
  ;; recursive
  (define (f n)
    (if (< n 3)
        n
        (+ (f (- n 1))
           (* (f (- n 2)) 2)
           (* (f (- n 3)) 3))))
#+end_src
#+begin_src scheme
  ;; iteration
  (define (f n)
    (define (iter a b c count)
      (if (= count 0)
          c
          (iter b
                c
                (+ c
                   (* b 2)
                   (* a 3))
                (- count 1))))

    (if (< n 3)
        n
        (iter 0 1 2 (- n 2))))

  (f 1)
#+end_src

#+RESULTS:
: 1

** DONE 1.12
   CLOSED: [2019-06-13 Thu 19:00]
#+begin_src scheme :results output :exports both
  (define (pascal-triangle n)
    (define (pascal-triangle-element x y)
      (if (or (= y 1) (= x y))
          1
          (+ (pascal-triangle-element (- x 1) (- y 1))
             (pascal-triangle-element (- x 1) y))))

    (define (line-maker n)
      (define (element-iter i)
        (if (<= i n)
            (string-append (number->string (pascal-triangle-element n i))
                           " "
                           (element-iter (+ i 1)))
            ""))
      (element-iter 1))

    (define (triangle-maker n)
      (define (line-iter i)
        (when (<= i n)
          (display (string-append (build-string (- n i) (λ(i) #\space))
                                  (line-maker i)))
          (newline)
          (line-iter (+ i 1))))
      (line-iter 1))

    (triangle-maker n))

  (pascal-triangle 5)
#+end_src

#+RESULTS:
:     1
:    1 1
:   1 2 1
:  1 3 3 1
: 1 4 6 4 1

** DONE 1.27
   CLOSED: [2019-06-05 Wed 00:22]
#+begin_src scheme :results output :exports both
  (define (check-carmichael n)
    (define (iter start n)
      (if (= start n)
          (println (string-append (number->string n) " " "is a carmichael number"))
          (if (same-mod start n)
              (iter (+ start 1) n)
              (println (string-append (number->string n) " " "is not a carmichael number")))))

    (define (same-mod a n)
      (= (remainder (expt a n) n)
         (remainder a n)))

    (iter 1 n))

  (check-carmichael 561)
  (check-carmichael 1105)
  (check-carmichael 1729)
  (check-carmichael 2465)
  (check-carmichael 2821)
  (check-carmichael 6601)
  (check-carmichael 6602)
#+end_src

#+RESULTS:
: "561 is a carmichael number"
: "1105 is a carmichael number"
: "1729 is a carmichael number"
: "2465 is a carmichael number"
: "2821 is a carmichael number"
: "6601 is a carmichael number"
: "6602 is not a carmichael number"

